Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t


Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t.DimensionSetBase
DO NOT USE! For internal usage only!///

Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t.Attributes
DO NOT USE! For internal usage only!///

Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t.Distance
DO NOT USE! For internal usage only!///

Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t.UpDirection
DO NOT USE! For internal usage only!///

Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t.LeftTagLineOffset
DO NOT USE! For internal usage only!///

Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t.RightTagLineOffset
DO NOT USE! For internal usage only!///

Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t.ToStruct(Tekla.Structures.Drawing.StraightDimensionSet)
DO NOT USE! For internal usage only!///

Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t.FromStruct(Tekla.Structures.Drawing.StraightDimensionSet)
DO NOT USE! For internal usage only!///